/*ТреТа Задача 3 (0/0)
Да се напише програма која ќе ги отпечати на стандарден излез секој трет збор од датотеката,
но така што буквите од зборовите да се сите мали и во зборовите буквата а и претходната буква да си ги заменат местата. 
Ако а се наоѓа на почеток на зборот, тогаш да биде со голема буква.
На пример модифициран зборот inForMatika би бил inforamtiak.
_Забелшака: Во датотеката зборовите се составени само од алфанумерички знаци и се оделени со празно место или нов ред.
Максималниот број на знаци во еден збор е 20.
*/

