/*Задача 2 (0 / 0)

Од стандарден влез се вчитува матрица со димензии M x N. 
Да се напише програма која ќе приреди матрица со исти димензии, 
секој елемент ќе го замени со збирот на неговите соседи елементи (по хоризонтала и вертикала) 
кои се поголеми од самиот тој елемент. Соседните елементи на еден елемент во матрицата се елементите 
кои се наоѓаат горе, долу, лево и десно од самиот елемент (ако елементот е дел од правата или последната 
редица или колона му недостасува некој сосед).*/

//"C:\Users\janak\Downloads\Задачи-20250126T123745Z-001\Задачи\Испитни задачи\2\2.png"